Revit 2026 API

# IFCAggregateIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IFCData Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As IFCData
	Get
```
```cpp
public:
virtual property IFCData^ Current {
	IFCData^ get ();
}
```
```fsharp
abstract Current : IFCData with get
override Current : IFCData with get
```

#### Property Value

IFCData

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

IFCAggregateIterator Class

Autodesk.Revit.DB.IFC Namespace